pe-exercises.org
# -*- fill-column: 80; org-confirm-babel-evaluate: nil -*-

#+TITLE:     Selected Project Euler Exercises
#+AUTHOR:    Oleg Sivokon
#+EMAIL:     olegsivokon@gmail.com
#+DATE:      <2015-10-15 Thu>
#+DESCRIPTION: Selected Project Euler Exercise, Assignment for Firmitas CS
#+KEYWORDS: Project Euler, Assignment, Firmitas
#+LANGUAGE: en
#+LaTeX_CLASS: article
#+LATEX_HEADER: \usepackage[usenames,dvipsnames]{color}
#+LATEX_HEADER: \usepackage{commath}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{enumerate}
#+LATEX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usemintedstyle{perldoc}
#+LATEX_HEADER: \hypersetup{urlcolor=blue}
#+LATEX_HEADER: \hypersetup{colorlinks,urlcolor=blue}
#+LATEX_HEADER: \setlength{\parskip}{16pt plus 2pt minus 2pt}
#+LATEX_HEADER: \renewcommand{\arraystretch}{1.6}
#+LATEX_HEADER: \definecolor{codebg}{rgb}{0.96,0.99,0.8}

#+BEGIN_SRC emacs-lisp :exports none
  (setq org-latex-pdf-process
          '("latexmk -pdflatex='pdflatex -shell-escape -interaction nonstopmode' -pdf -f %f")
          org-latex-listings 'minted
          org-latex-minted-options
          '(("bgcolor" "codebg") ("fontsize" "\\scriptsize"))
          org-src-fontify-natively t
          org-listings-escape-inside '("(*@" . "@*)")
          org-babel-latex-htlatex "htlatex")

  (defmacro by-backend (&rest body)
      `(cl-case (when (boundp 'backend) (org-export-backend-name backend))
         ,@body))

  (defun cpp-includes ()
      (append '("<iostream>" "<vector>" "<cmath>" "<algorithm>" "<string>"
                "<fstream>" "<gmpxx.h>")
              (cl-loop with cwd = (file-name-directory (buffer-file-name))
                       for inc in '("combinatorics" "primes" "cards")
                       collect (format "\"%scxx/%s.cxx\"" cwd inc))))
#+END_SRC

#+RESULTS:
: by-backend

#+BEGIN_LaTeX
\newpage
#+END_LaTeX

* Foreword
  This document contains several Project Euler problems solved in Python and
  C++.  It was written using [[http://orgmode.org/][org-mode]] for Emacs.  To uninitiated, this means
  that this document was originally written in plain text and later converted to
  LaTeX source.  This also means that this document contains [[http://orgmode.org/worg/org-contrib/babel/][Babel]] source code
  blocks which allow code evaluation during conversion to LaTeX.

  I made the decision to structure the submission in this way because this
  allows for controlled and at the same time typographically appealing
  presentation of my work.  While I was required to pretend to work on a
  ``real'' project, I find it hard to think about a set of disparate
  number-theoretic problems as comprising a software engineering project in the
  common sense of the word.  It seemed like an article might prove better
  experience due to having more room for discussion illustrated by small code
  snippets.

  Few disclaimers are due.  I am not really a C++ programmer.  This project,
  perhaps, contains the largest amount of C++ code I've ever written.  The way I
  worked through the problems was to first solve them in Python and then to
  translate them into C++.  While my Python code would probably meet the
  industry standards, I excpect my C++ code to be subpar, both as not-idiomatic
  and inefficient, or, perhaps even outright wrong in its dealing with memory
  allocation and other complications of C++.  Basically, I worked on it until I
  could produce the result I knew to be correct, and left it immediately
  afterwards.

  As of time of this writing, I didn't solve the $136^{th}$ problem, though I do
  have some thoughts on how to approach it.  I've written some of it in the last
  paragraph.

  The project has a Makefile, and, provided you have all the dependencies, you
  should be able to reproduce this document.  Plain ``vanilla'' Emacs should be
  enough for the =org-mode= and =babel= dependencies.  My Python code doesn't
  use anything outside of standard library, while C++ code relies on [[https://gmplib.org/][GNU MP]]
  library for biginteger support.  This means that you need to have development
  header =gmpxx.h= on your includes path.  On top of the typical LaTeX
  installation you would need the [[https://www.ctan.org/pkg/minted?lang=en][minted]] package (for coloring the source code
  blocks).

  Not all code is presented in the document.  The auxilary functions are found
  in [[./python]] and [[./cxx]] directories.  There is also [[file:latex/refman.pdf][some documentation]] generated
  for them using [[http://www.stack.nl/~dimitri/doxygen/][Doxygen]]. It was difficult to include the documentation directly
  in this document (LaTeX style clashes etc.) thus the documentation takes up a
  separate document.

* Exercises
** 1000-digits Fibonacci number PE-25
*** Problem Statement
    The Fibonacci sequence is defined by the recurrence relation:
    
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{equation*}
        F_n = F_{n-1} + F_{n-2},\; \textit{where}\; F_1 = 1\; \textit{and} \; F_2 = 1\;.
      \end{equation*}
    #+END_SRC
    
    Hence the first 12 terms will be:
    
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        F_1    &= 1   \\
        F_2    &= 1   \\
        F_3    &= 2   \\
        F_4    &= 3   \\
        F_5    &= 5   \\
        F_6    &= 8   \\
        F_7    &= 13  \\
        F_8    &= 21  \\
        F_9    &= 34  \\
        F_{10} &= 55  \\
        F_{11} &= 89  \\
        F_{12} &= 144
      \end{align*}
    #+END_SRC
    
    The $12^{th}$ term, $F_{12}$, is the first term to contain three digits.
    
    What is the index of the first term in the Fibonacci sequence 
    to contain 1000 digits?

*** Discussion
    Start with some initial guess: $fib(1000)$ and double the size until we find
    a number with more than 1000 digits once done, subtract the half of the last
    increment, depending on whether we overshoot or undershoot subtract or add
    the quarter of the last increment and so on, until we find two adjacent
    Fibonacci numbers such that the first has at most 999 digits and the second
    has 1000 or more digits.  This will ensure that we calculate at most
    $log(1000) \approx 10$ operations.  Afterwards, because there could be
    several Fibonacci numbers of the same length, we'll find the smallest one
    using linear search (this won't take more than $log(2^4) = 4$ operations.)

*** Solution

    #+HEADER: :exports both
    #+BEGIN_SRC python
      from python.combinatorics import fib, digits

      n = 1000
      guess = fib(n)
      while len(digits(guess)) < 1000:
          n *= 2
          guess = fib(n)
      m = n // 4
      n -= m
      while m > 1:
          guess = fib(n)
          m //= 2
          if len(digits(guess)) > 1000:
              n -= m
          else:
              n += m
      while len(digits(guess)) >= 1000:
          n -= 1
          guess = fib(n)
      return n + 1
    #+END_SRC

    #+RESULTS:
    : 4782

    #+HEADER: :exports both
    #+HEADER: :flags -lgmp -lgmpxx -std=c++0x
    #+BEGIN_SRC C++ :includes `(,@(cpp-includes))
      int n = 1000;
      mpz_class guess = fib(n);

      while (mpz_sizeinbase(guess.get_mpz_t(), 10) < 1000) {
          n *= 2;
          guess = fib(n);
      }
      int m = n / 4;
      n -= m;
      while (m > 1) {
          guess = fib(n);
          m /= 2;
          if (mpz_sizeinbase(guess.get_mpz_t(), 10) > 1000) {
              n -= m;
          } else {
              n += m;
          }
      }
      while (mpz_sizeinbase(guess.get_mpz_t(), 10) >= 1000) {
          n--;
          guess = fib(n);
      }
      std::cout << n + 1;
    #+END_SRC

    #+RESULTS:
    : 4782

** Goldbach's other conjecture PE-46
*** Problem statement
    It was proposed by Christian Goldbach that every odd composite number can be
    written as the sum of a prime and twice a square.
    
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        9  &= 7  + 2 \times 12 \\
        15 &= 7  + 2 \times 22 \\
        21 &= 3  + 2 \times 32 \\
        25 &= 7  + 2 \times 32 \\
        27 &= 19 + 2 \times 22 \\
        33 &= 31 + 2 \times 12
      \end{align*}
    #+END_SRC
    
    It turns out that the conjecture was false.
    
    What is the smallest odd composite that cannot be written as the sum of a
    prime and twice a square?

