pe-exercises.tex
% Created 2015-10-18 Sun 11:17
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[hidelinks]{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage[usenames,dvipsnames]{color}
\usepackage{commath}
\usepackage{color}
\usepackage{enumerate}
\usepackage{minted}
\usemintedstyle{perldoc}
\hypersetup{urlcolor=blue}
\hypersetup{colorlinks,urlcolor=blue}
\setlength{\parskip}{16pt plus 2pt minus 2pt}
\renewcommand{\arraystretch}{1.6}
\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\author{Oleg Sivokon}
\date{\textit{<2015-10-15 Thu>}}
\title{Selected Project Euler Exercises}
\hypersetup{
 pdfauthor={Oleg Sivokon},
 pdftitle={Selected Project Euler Exercises},
 pdfkeywords={Project Euler, Assignment, Firmitas},
 pdfsubject={Selected Project Euler Exercise, Assignment for Firmitas CS},
 pdfcreator={Emacs 25.0.50.1 (Org mode 8.3beta)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\newpage

\section{Foreword}
\label{sec:orgheadline1}
This document contains several Project Euler problems solved in Python and
C++.  It was written using \href{http://orgmode.org/}{org-mode} for Emacs.  To uninitiated, this means
that this document was originally written in plain text and later converted to
\LaTeX{} source.  This also means that this document contains \href{http://orgmode.org/worg/org-contrib/babel/}{Babel} source code
blocks which allow code evaluation during conversion to \LaTeX{}.

I made the decision to structure the submission in this way because this
allows for controlled and at the same time typographically appealing
presentation of my work.  While I was required to pretend to work on a
``real'' project, I find it hard to think about a set of disparate
number-theoretic problems as comprising a software engineering project in the
common sense of the word.  It seemed like an article might prove better
experience due to having more room for discussion illustrated by small code
snippets.

Few disclaimers are due.  I am not really a C++ programmer.  This project,
perhaps, contains the largest amount of C++ code I've ever written.  The way I
worked through the problems was to first solve them in Python and then to
translate them into C++.  While my Python code would probably meet the
industry standards, I excpect my C++ code to be subpar, both as not-idiomatic
and inefficient, or, perhaps even outright wrong in its dealing with memory
allocation and other complications of C++.  Basically, I worked on it until I
could produce the result I knew to be correct, and left it immediately
afterwards.

As of time of this writing, I didn't solve the \(136^{th}\) problem, though I do
have some thoughts on how to approach it.  I've written some of it in the last
paragraph.

The project has a Makefile, and, provided you have all the dependencies, you
should be able to reproduce this document.  Plain ``vanilla'' Emacs should be
enough for the \texttt{org-mode} and \texttt{babel} dependencies.  My Python code doesn't
use anything outside of standard library, while C++ code relies on \href{https://gmplib.org/}{GNU MP}
library for biginteger support.  This means that you need to have development
header \texttt{gmpxx.h} on your includes path.  On top of the typical \LaTeX{}
installation you would need the \href{https://www.ctan.org/pkg/minted?lang=en}{minted} package (for coloring the source code
blocks).

Not all code is presented in the document.  The auxilary functions are found
in \url{./python} and \url{./cxx} directories.  There is also some documentation generated
for them using \href{http://www.stack.nl/~dimitri/doxygen/}{Doxygen}. It was difficult to include the documentation directly
in this document (\LaTeX{} style clashes etc.) thus the documentation takes up a
separate document.

\section{Exercises}
\label{sec:orgheadline21}
\subsection{1000-digits Fibonacci number PE-25}
\label{sec:orgheadline5}
\subsubsection{Problem Statement}
\label{sec:orgheadline2}
The Fibonacci sequence is defined by the recurrence relation:

\begin{equation*}
  F_n = F_{n-1} + F_{n-2},\; \textit{where}\; F_1 = 1\; \textit{and} \; F_2 = 1\;.
\end{equation*}


Hence the first 12 terms will be:

\begin{align*}
  F_1    &= 1   \\
  F_2    &= 1   \\
  F_3    &= 2   \\
  F_4    &= 3   \\
  F_5    &= 5   \\
  F_6    &= 8   \\
  F_7    &= 13  \\
  F_8    &= 21  \\
  F_9    &= 34  \\
  F_{10} &= 55  \\
  F_{11} &= 89  \\
  F_{12} &= 144
\end{align*}


The \(12^{th}\) term, \(F_{12}\), is the first term to contain three digits.

What is the index of the first term in the Fibonacci sequence 
to contain 1000 digits?

\subsubsection{Discussion}
\label{sec:orgheadline3}
Start with some initial guess: \(fib(1000)\) and double the size until we find
a number with more than 1000 digits once done, subtract the half of the last
increment, depending on whether we overshoot or undershoot subtract or add
the quarter of the last increment and so on, until we find two adjacent
Fibonacci numbers such that the first has at most 999 digits and the second
has 1000 or more digits.  This will ensure that we calculate at most
\(log(1000) \approx 10\) operations.  Afterwards, because there could be
several Fibonacci numbers of the same length, we'll find the smallest one
using linear search (this won't take more than \(log(2^4) = 4\) operations.)

\subsubsection{Solution}
\label{sec:orgheadline4}

\begin{minted}[bgcolor=codebg,fontsize=\scriptsize]{python}
from python.combinatorics import fib, digits

n = 1000
guess = fib(n)
while len(digits(guess)) < 1000:
    n *= 2
    guess = fib(n)
m = n // 4
n -= m
while m > 1:
    guess = fib(n)
    m //= 2
    if len(digits(guess)) > 1000:
        n -= m
    else:
        n += m
while len(digits(guess)) >= 1000:
    n -= 1
    guess = fib(n)
return n + 1
\end{minted}

\begin{verbatim}
4782
\end{verbatim}

\begin{minted}[bgcolor=codebg,fontsize=\scriptsize]{c++}
int n = 1000;
mpz_class guess = fib(n);

while (mpz_sizeinbase(guess.get_mpz_t(), 10) < 1000) {
    n *= 2;
    guess = fib(n);
}
int m = n / 4;
n -= m;
while (m > 1) {
    guess = fib(n);
    m /= 2;
    if (mpz_sizeinbase(guess.get_mpz_t(), 10) > 1000) {
        n -= m;
    } else {
        n += m;
    }
}
while (mpz_sizeinbase(guess.get_mpz_t(), 10) >= 1000) {
    n--;
    guess = fib(n);
}
std::cout << n + 1;
\end{minted}

\begin{verbatim}
4782
\end{verbatim}

\subsection{Goldbach's other conjecture PE-46}
\label{sec:orgheadline9}
\subsubsection{Problem statement}
\label{sec:orgheadline6}
It was proposed by Christian Goldbach that every odd composite number can be
written as the sum of a prime and twice a square.

\begin{align*}
  9  &= 7  + 2 \times 12 \\
  15 &= 7  + 2 \times 22 \\
  21 &= 3  + 2 \times 32 \\
  25 &= 7  + 2 \times 32 \\
  27 &= 19 + 2 \times 22 \\
  33 &= 31 + 2 \times 12
\end{align*}


It turns out that the conjecture was false.

What is the smallest odd composite that cannot be written as the sum of a
prime and twice a square?
