pe-exercises.tex

\subsubsection{Discussion}
\label{sec:orgheadline7}
There doesn't seem to be an easier way than just a brute-force search.  In
other words, the code simply generates subsequent odd composite numbers and
tests whether the number complies with the contstraints of conjecture.

\subsubsection{Solution}
\label{sec:orgheadline8}
\begin{minted}[bgcolor=codebg,fontsize=\scriptsize]{python}
import math
from python.primes import odd_composite, primes

def decomposes_goldbach(n):
    """
    Returns True iff n can be decomposed into p + 2 * i^2, where
    p is a prime and i is an integer.
    """
    for p in primes():
        if p > n:
            return False
        rest = n - p
        if rest % 2 == 0 and int(math.sqrt(rest // 2)) ** 2 == rest // 2:
            return True

for c in odd_composite():
    if not decomposes_goldbach(c):
        return c
\end{minted}

\begin{verbatim}
5777
\end{verbatim}

\begin{minted}[bgcolor=codebg,fontsize=\scriptsize]{c++}
primes ps;
int result, p, c;
bool found = false;

while (!found) {
    p = ps.next();
    c = p + 2;
    p = ps.next();
    while (c < p) {
        if (!decomposes_goldbach(c)) {
            result = c;
            found = true;
            break;
        }
        c += 2;
    }
}
std::cout << result;
\end{minted}

\begin{verbatim}
5777
\end{verbatim}

\subsection{Largest sum of consequtive primes PE-50}
\label{sec:orgheadline13}
\subsubsection{Problem statement}
\label{sec:orgheadline10}
The prime 41, can be written as the sum of six consecutive primes:

\begin{align*}
  41 = 2 + 3 + 5 + 7 + 11 + 13
\end{align*}

This is the longest sum of consecutive primes that adds to a prime
below one-hundred.

The longest sum of consecutive primes below one-thousand that adds
to a prime, contains 21 terms, and is equal to 953.

Which prime, below one-million, can be written as the sum of the
most consecutive primes?

\subsubsection{Discussion}
\label{sec:orgheadline11}
In the preparation phase the code generates all primes which add up to less
than a million, while at the same time calculating sums of the primes
generated so far.  This acts as a cache for the sums we would have to
calculate repeatedly whenever we'd verify every other sequence of primes.

During the next step the code chooses sums in order of decreasing number of
summands, iteratively updating the maximum prime for the longest sequence
found so far.  Once no sums of the longest-so-far sequence can be found,
the lagorithm terminates.

\subsubsection{Solution}
\label{sec:orgheadline12}
\begin{minted}[bgcolor=codebg,fontsize=\scriptsize]{python}
from python.primes import primes, is_prime

sieve, prefixes, max_prime, longest_seq = [], [0], 0, 0
for p in primes():
    if prefixes[-1] + p > 1000000:
        break
    sieve.append(p)
    prefixes.append(prefixes[-1] + p)
terms = 1
for i in range(len(prefixes)):
    for j in range(i + terms, len(prefixes)):
        n = prefixes[j] - prefixes[i]
        if j - i > terms:
            is_p, sieve = is_prime(n, sieve)
            if is_p:
                terms, max_prime = j - i, n
return max_prime
\end{minted}

\begin{verbatim}
997651
\end{verbatim}

\begin{minted}[bgcolor=codebg,fontsize=\scriptsize]{c++}
primes ps(1000000);
std::vector<int> sums(ps.size());
int max_prime;
std::size_t terms = 1;
std::size_t top;

sums[0] = ps[0];
for (std::size_t i = 1; i < ps.size(); i++) {
    if (sums[i - 1] + ps[i] > 1000000) {
        top = i;
        break;
    }
    sums[i] = sums[i - 1] + ps[i];
}
for (std::size_t i = 0; i < top; i++) {
    for (std::size_t j = terms + i; j < top; j++) {
        int n = sums[j] - sums[i];
        if (j - i > terms && ps.is_prime(n)) {
            terms = j - i;
            max_prime = n;
        }
    }
}
std::cout << max_prime;
\end{minted}

\begin{verbatim}
997651
\end{verbatim}

\subsection{Poker game PE-54}
\label{sec:orgheadline17}
\subsubsection{Problem statement}
\label{sec:orgheadline14}
In the card game poker, a hand consists of five cards 
and are ranked, from lowest to highest, in the following way:

\begin{description}
\item[{High Card}] Highest value card.
\item[{One Pair}] Two cards of the same value.
\item[{Two Pairs}] Two different pairs.
\item[{Three of a Kind}] Three cards of the same value.
\item[{Straight}] All cards are consecutive values.
\item[{Flush}] All cards of the same suit.
\item[{Full House}] Three of a kind and a pair.
\item[{Four of a Kind}] Four cards of the same value.
\item[{Straight Flush}] All cards are consecutive values of same suit.
\item[{Royal Flush}] Ten, Jack, Queen, King, Ace, in same suit.
\end{description}

The cards are valued in the order:

\begin{align*}
  2, 3, 4, 5, 6, 7, 8, 9, 10, Jack, Queen, King, Ace.
\end{align*}


If two players have the same ranked hands then the rank made up of the
highest value wins; for example, a pair of eights beats a pair of fives (see
example 1 below). But if two ranks tie, for example, both players have a
pair of queens, then highest cards in each hand are compared (see example 4
below); if the highest cards tie then the next highest cards are compared,
and so on.

Consider the following five hands dealt to two players:

\begin{center}
\begin{tabular}{lll}
Player 1 & Player 2 & Winner\\
\hline
5H 5C 6S 7S KD & 2C 3S 8S 8D TD & Player 2\\
Pair of Fives & Pair of Eights & \\
\hline
5D 8C 9S JS AC & 2C 5C 7D 8S QH & Player 1\\
Highest card Ace & Highest card Queen & \\
\hline
2D 9C AS AH AC & 3D 6D 7D TD QD & Player 2\\
Three Aces & Flush with Diamonds & \\
\hline
4D 6S 9H QH QC & 3D 6D 7H QD QS & Player 1\\
Pair of Queens & Pair of Queens & \\
Highest card Nine & Highest card Seven & \\
\hline
2H 2D 4C 4D 4S & 3C 3D 3S 9S 9D & Player 1\\
Full House & Full House & \\
With Three Fours & with Three Threes & \\
\end{tabular}
\end{center}

The file, poker.txt, contains one-thousand random hands dealt to two
players. Each line of the file contains ten cards (separated by a single
space): the first five are Player 1's cards and the last five are Player 2's
cards. You can assume that all hands are valid (no invalid characters or
repeated cards), each player's hand is in no specific order, and in each
hand there is a clear winner.

How many hands does Player 1 win?
