pe-exercises.org
*** Discussion
    Player's hand will be represented by a class =Hand=.  This class is
    initalized with the raw card data.  During initialization the cards are
    sorted in order from least to highest denomination.  =Hand= class will aslo
    implement operators required for comparison.  Once such operator is called,
    the code will determine (and cache):

    1. The value of the hand.  Hands are given values using the following scheme:
       + If no special combination is found (s.a. /flush/), then the hand is
         worth as much as its highest denomination card.
       + Special denominations recieve one point more than the highest card,
         plus their relative rank, i.e. /one pair/ receives 15, /two pairs/
         recieves 16 and so on.
       + Ties aren't broken at this time.
    2. The stretches of cards of the same denomination.
    3. If the code encounters a tie, it tries to break it using the rules given
       below.
       + Given the =stretches= information the code will select only the cards
         that will influence the decision.
       + Compare selected cards in order from highest to lowest denomination.
         
    The =cards_txt= file can be found in [[./etc/p054_poker.txt]].

*** Solution
    #+HEADER: :exports both :var cards_txt=(expand-file-name "./etc/p054_poker.txt" ".")
    #+BEGIN_SRC python
      from python.cards import Hand

      with open(cards_txt, 'r') as f:
          wins = 0
          for line in f:
              cards = line.strip().split(" ")
              if Hand(cards[:5]) > Hand(cards[5:]):
                  wins += 1
          return wins
    #+END_SRC

    #+RESULTS:
    : 376

    #+HEADER: :exports both
    #+HEADER: :flags -lgmp -lgmpxx -std=c++0x
    #+HEADER: :var poker_txt="./etc/p054_poker.txt"
    #+BEGIN_SRC C++ :includes `(,@(cpp-includes))
      std::ifstream in(poker_txt);
      std::string line;
      int result = 0;
      while (std::getline(in, line)) {
          hand a(line.substr(0, 3 * 5));
          hand b(line.substr(3 * 5, 3 * 10 - 1));
          if (a > b) {
              result++;
          }
      }
      std::cout << result;
    #+END_SRC

    #+RESULTS:
    : 376
** Unique arithmetic progressions
*** Problem statement
    The positive integers, $x$, $y$, and $z$, are consecutive terms of an
    arithmetic progression.  Given that $n$ is a positive integer, the equation,
    $x^2-y^2-z^2 = n$, has exactly one solution when $n = 20$:

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      13^2 - 10^2 - 7^2 = 20
    #+END_SRC

    In fact there are twenty-five values of n below one hundred for which the
    equation has a unique solution.

    How many values of n less than fifty million have exactly one solution?

*** Discussion
    First, we could reduce the number of variables:
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        a^2 - b^2 - c^2                         &= n \iff \\
        (d + 2x)^2 - (d + x)^2 - d^2            &= n \iff \\
        \textit{from arithmetic progression definition} & \\
        d^2 + 4dx + 4x^2 - d^2 - 2dx - x^2 - d^2 &= n \iff \\
        -d^2 + 2dx + 3x^2                        &= n \iff \\
        (d + x)^2 - 2(d^2 - x^2)                 &= n
      \end{align*}
    #+END_SRC
    We also know that both $d$ and $x$ must be positive.  My guess is that we
    could look for solution by differentiating this equation with respect to
    either of these variables.
    
    I was looking for ways to give upper bounds to either one of the variables,
    s.a. to make sure that if I try to verify that $n$ is unique, I would only
    need to do finite amount of work, but I don't have any good idea so far.  I
    have a feeling that both $x < \sqrt{n}$ and $d < \sqrt{n}$, but I cannot
    prove it.
