pe-exercises.tex

\subsubsection{Discussion}
\label{sec:orgheadline15}
Player's hand will be represented by a class \texttt{Hand}.  This class is
initalized with the raw card data.  During initialization the cards are
sorted in order from least to highest denomination.  \texttt{Hand} class will aslo
implement operators required for comparison.  Once such operator is called,
the code will determine (and cache):

\begin{enumerate}
\item The value of the hand.  Hands are given values using the following scheme:
\begin{itemize}
\item If no special combination is found (s.a. \emph{flush}), then the hand is
worth as much as its highest denomination card.
\item Special denominations recieve one point more than the highest card,
plus their relative rank, i.e. \emph{one pair} receives 15, \emph{two pairs}
recieves 16 and so on.
\item Ties aren't broken at this time.
\end{itemize}
\item The stretches of cards of the same denomination.
\item If the code encounters a tie, it tries to break it using the rules given
below.
\begin{itemize}
\item Given the \texttt{stretches} information the code will select only the cards
that will influence the decision.
\item Compare selected cards in order from highest to lowest denomination.
\end{itemize}
\end{enumerate}

The \texttt{cards\_txt} file can be found in \url{./etc/p054_poker.txt}.

\subsubsection{Solution}
\label{sec:orgheadline16}
\begin{minted}[bgcolor=codebg,fontsize=\scriptsize]{python}
from python.cards import Hand

with open(cards_txt, 'r') as f:
    wins = 0
    for line in f:
        cards = line.strip().split(" ")
        if Hand(cards[:5]) > Hand(cards[5:]):
            wins += 1
    return wins
\end{minted}

\begin{verbatim}
376
\end{verbatim}

\begin{minted}[bgcolor=codebg,fontsize=\scriptsize]{c++}
std::ifstream in(poker_txt);
std::string line;
int result = 0;
while (std::getline(in, line)) {
    hand a(line.substr(0, 3 * 5));
    hand b(line.substr(3 * 5, 3 * 10 - 1));
    if (a > b) {
        result++;
    }
}
std::cout << result;
\end{minted}

\begin{verbatim}
376
\end{verbatim}
\subsection{Unique arithmetic progressions}
\label{sec:orgheadline20}
\subsubsection{Problem statement}
\label{sec:orgheadline18}
The positive integers, \(x\), \(y\), and \(z\), are consecutive terms of an
arithmetic progression.  Given that \(n\) is a positive integer, the equation,
\(x^2-y^2-z^2 = n\), has exactly one solution when \(n = 20\):

13\(^{\text{2}}\) - 10\(^{\text{2}}\) - 7\(^{\text{2}}\) = 20

In fact there are twenty-five values of n below one hundred for which the
equation has a unique solution.

How many values of n less than fifty million have exactly one solution?

\subsubsection{Discussion}
\label{sec:orgheadline19}
\end{document}